<!DOCTYPE html>
<html dir = "rtl">
    <head>
	<meta name = "keywords" content = "html">
		<style>
            body{
			background-color : #f0f0f0;
			}
			h1{
			background-color : #000099;
			color : white;
			padding : 30px;
			margin : 0;
			}
			li a{
			text-decoration : none;
			color : #3366ff;
			font-size : 25px;
			}
			ol{
			font-size : 25px; 
			}
			ul{
			font-size : 25px; 
			}
        </style>
		<meta name = "viewport" content = "width = device-width, initial-scale = 1.0">
    </head>
    <body>
        <h1 align = "center">
		    معلومات عن لغة البرمجة html واستخداماتها...
			<br/>
			تعرف معنا على كل ما يخص لغة البرمجة 
			<br/>
			html
	    </h1>
		<br/>
		<ol style = "border : 1px solid #3366ff; color : #3366ff; margin : 0;">
		    <li><a href = "#p1">لغات البرمجة</a></li>
		    <li><a href = "#p2">معلومات عن لغة البرمجة html واستخداماتها</a></li>
		    <li><a href = "#p3">ما هي الوسوم؟</a></li>
		    <li><a href = "#p4">تاريخ وتطور لغة html</a></li>
		    <li><a href = "#p5">خصائص ومميزات لغة البرمجة html</a></li>
		    <li><a href = "#p6">استخدامات لغة البرمجة html</a></li>
		</ol>
		<br/>
		<center>
		<img src = "programming.jpg" title = "programming image"/>
		</center>
		<hr/>
        <font size = 5>
	        لغة html  تعد أحد لغات البرمجة المهمة، وتعتبر العمود الفقري، والرئيسي لصفحات الويب…
			<br/>
			ولقد خصصنا هذا المقال لنتعرف على معلومات عن لغة البرمجة html واستخداماتها:
	    </font>
		<br/><br/><br/>
		<h2 id = "p1">
		    لغات البرمجة
		</h2>
		<ol>
		    <li>تتعدد لغات ترميز النصوص داخل شبكة الانترنت، ومن  أشهر الأمثلة عليها  هي لغة HTML.</li>
			<li>فهي واحدة من بروتوكولات الإنترنت الضرورية، والمهمة، والتي تحتوي على عدد كبير من 
			
			الأساليب المعروفة في مجال النشر لتشكيل حلقة وصل بين المحرر، والمؤلف.</li>
		</ol>
		<br/>
		<h2 id = "p2">
		    معلومات عن لغة البرمجة html واستخداماتها
		</h2>
		<ol>
		    <li>هي اختصار للمصطلح Hyper Text Markup Language، وتسمى بلغة ترميز النصوص التشعبية
			<br/>
			فهي لغة ترميز خاصة ابتكرت لأجل انشاء وتصميم صفحات الويب.
			</li>
			<li>تعد لغة البرمجة html العمود الفقري، والرئيسي لصفحات الويب، وبنيتها التحتية فهي توضح شرحاً
			<br/>
			مفصلاً حول الشكل الذي تكون عليه آلية عرض محتويات الموقع الإلكتروني من خلال تقسيمه إلى
			<br/>
			عنوان وفقرات، وذلك بالاعتماد على ما يسمى بالوسوم.
			</li>
		</ol>
		<br/>
		<img src = "html.jpg" title = "html image"/>
		<br/><br/>
		<h2 id = "p3">
		    ما هي الوسوم؟
		</h2>
		<font size = 5>
		    الوسوم هي الجزء الأساسي في انشاء صفحة الويب، ومن خلالها تأخذ الصفحة عدة أوامر خاصة وتقوم بتنفيذها،
			<br/>
			واستخدامها في تكوين شكل صفحة الويب،وجميع الوسوم تنحصر بين اشارتي < >، 
			<br/>
			وهي نوعان أساسيان هما:
		<ul>
			<li>وسم البداية: ويتعين من المستخدم وضع بدية، ونهاية لكل أمر أو وسم لكي ينفذ بطريقة صحيحة.</li>
			<li>وسم النهاية: يكون مرفق عادة بالإشارة / وذلك لإغلاق الأمر المعطى.</li>
		</ul>
		</font>
		<br/>
		<h2 id = "p4">
		    تاريخ وتطور لغة html
		</h2>
		<ul>
		    <li>كان أول من ابتكر لغة html الفيزيائي تيم بيرنرز لي عاك 1980 من خلال مؤسسة سيرن للأبحاث
			<br/>
			النووية وذلك بإعداد نموذج يساعد الباحثين في المؤسسة من مشاركة المستندات.</li>
			<br/>
			<li>ثم قام بيرنرز بإبتكار نص هايبر تكست مبني على الإنترنت عام 1989.</li>
			<br/>
			<li>وفي عام 1990 قام بكتابة برنامج المزود ووصفة لغة البرمجة HTML.</li>
			<br/>
			<li>في أواخر عام 1991 قدم وثيقة للجمهور تسمى علامات html، ويصف من خلالها 18 عنصر تتألف منها.</li>
			<br/>
			<li>خلال عام 1993 نشر أول اقتراح لمواصفات HTML: "لغة توصيف النص التشعبي  <span title = "Hiber Text Markup Language">(HTML)</span>".</li>
		</ul>
		<br/>
		<h2 id = "p5">
		    خصائص ومميزات لغة البرمجة html
		</h2>
		<ol>
		    <li>لا تحتاج برامج تصميم وتكتفي ببرنامج المفكرة الذي يأتي مع برنامج الويندوز أو برنامج الدفتر.</li>
		    <li>سهلة التعلم حيث يتمكن المستخدم لها من تصميم صفحة خلال وقت قصير جداً.</li>
		    <li>تساعد في إجراء المثير من التعديلات على الموقع بكل سهولة.</li>
     		<li>إمكانية الكتابة باستخدام اللغة العربية.</li>
	    	<li>تتميز بإمكانية إضافة أي نصوص برمجية كنصوص الجافا البرمجية أو نصوص DHTML.</li>
    		<li>تتيح إمكانية ترجمة النصوص البرمجية إلى اللغة العربية.</li>
    		<li>إمكانية التحكم الدقيق في خصائص الصفحة.</li>
    		<li>معظم برامج التصميم مبنية على أساس لغة HTML وهي الأساس لعدة برامج مثل برنامج Front Page.</li>
		</ol>
		<br/>
		<h2 id = "p6">
		    استخدامات لغة البرمجة html
		</h2>
		<ul>
		    <li>تستخدم في تصميم المواقع الالكترونية وبرمجتها.
			<br/>
			تتكون من مجموعة من الوسام تستخدم في:</li>
			<br/>
			<ol>
			<li>عرض الصور داخل الصفحة من خلال الوسم img.</li>
			<li>لعرض عنوان كبير داخل الصفحة نستخدم الوسم h1.</li>
			<br/>
			</ol>
			<li>تستخدم في ترجمة صفحات الويب وعرضها من خلال المتصفح.</li>
			<br/>
			<li>تستخدم لغة البرمجة html في اعطاء الأوامر لمتصفح الانترنت، وارشاده إلى طريقة عرض النصوص والروابط والصور.</li>
			<br/>
			<li>تساعد على الوصول إلى أماكن عرض الصور، والوسائط، والنصوص داخل صفحة الويب.</li>
			<br/>
			<li>تقوم بإمداد متصفح الويب بالمعلومات الخاصة بالصفحة كعنوانها، والكلمات الدلالية الخاصة بها، ووصفها.</li>
		</ul>
		<hr/>
		<address dir = "ltr">
		This website was created by:<br/>
		Aya Nasir Saadi<br/>
		Palestine<br/>
		</address>
    </body>
</html>
